### Importing Libraries

In [1]:
import pandas as pd
import pandasql

from pandasql import sqldf 
sql_run = lambda q: sqldf(q, globals())

### Question 1 : Find the 3rd Highest Salary

In [2]:
# Defining dataframe
employee_table = pd.DataFrame({
    'employee':['Alice', 'Benn', 'Charles', 'Dorothy', 'Emma', 'Franklin'],
    'salary':[10000,9500,9800,9900,10000,9000]
})
employee_table.sort_values(by='salary', ascending=False)

   employee  salary
0     Alice   10000
4      Emma   10000
3   Dorothy    9900
2   Charles    9800
1      Benn    9500
5  Franklin    9000

In [3]:
# SQL query 1
query1 = """
WITH RowNumber as
(SELECT DISTINCT salary, employee,
ROW_NUMBER() OVER(ORDER BY salary desc) as RN
FROM employee_table)

SELECT DISTINCT salary
FROM employee_table
WHERE salary IN (SELECT salary FROM RowNumber WHERE RN = 3 )
"""

sql_run(query1)

   salary
0    9900

### Question 2 : Find Items Bought

In [4]:
# Defining Dataframe
item_bought = pd.DataFrame({
    'buyer':['Alif', 'Bogie', 'Cahya', 'Dio', 'Elisa', 'Faiz','Galang','Husain','Indah','Jayadi','Khoirul'],
    'item':['Asus', 'Lenovo', 'Lenovo', 'Acer', 'Acer', 'Acer','Lenovo','Asus','Asus','Asus','Dell']
})
item_bought

      buyer    item
0      Alif    Asus
1     Bogie  Lenovo
2     Cahya  Lenovo
3       Dio    Acer
4     Elisa    Acer
5      Faiz    Acer
6    Galang  Lenovo
7    Husain    Asus
8     Indah    Asus
9    Jayadi    Asus
10  Khoirul    Dell

In [5]:
# SQL query 2
query2 = """
WITH Sorted1 as
(SELECT item, COUNT (*) as Amount
FROM item_bought
GROUP BY 1)

SELECT DISTINCT item
FROM item_bought
WHERE item IN
(SELECT item FROM Sorted1 WHERE Amount < (SELECT MAX(Amount) FROM Sorted1))
AND item IN 
(SELECT item FROM Sorted1 WHERE Amount > (SELECT MIN(Amount) FROM Sorted1))
ORDER BY item
"""

sql_run(query2)

     item
0    Acer
1  Lenovo

In [ ]:
with minimum as 
(select subject, min(score)
from students 
left join exam_result using (student_id)
group by 1)

select student_id,studnet_name
from students
where score <> (select min(score) from minimum where subject in ('Sports','Coking')
and score not in (select max(score from maximum where subject in ('Sports','Cooking')))